[
  {
    "name": "From Geek to Great: Supercharging career development with soft skills",
    "data": "20/07/2023",
    "hour": "19:00",
    "location": "La Nunziatina, Via la Nunziatina, 11, 56125 Pisa PI",
    "free": true,
    "registration": true,
    "author": "Gabriele Santomaggio + Federico Paolinelli + Lorenzo Pieri",
    "organizer": "Pisa.dev",
    "link": "https://pisa.dev/event/geek-to-great",
    "description": "<p>Un panel con due ospiti d'eccezione per festeggiare insieme il primo compleanno di Pisa.dev</p><p>Il 20 Luglio non perderti il panel 'From Geek to Great: Supercharging career development with soft skills'.</p><p>Il protagonisti del panel saranno Gabriele Santomaggio, Staff Software Engineer presso VMware e Federico Paolinelli, Senior Principal Software Engineer in Red Hat. A moderare la discussione sarà Lorenzo Pieri, Full Stack Software Engineer @ Birdie e Community Manager @ Schrödinger Hat.</p><p>Si parlerà di carriera, di soft skills e soprattutto, lasceremo un ampio spazio per le domande dal pubblico per accendere la discussione e rendere il tutto più interessante e divertente.</p><p>⏰ 20 Luglio 2023, a partire dalle 19:00</p><p>📍 La Nunziatina, Via la Nunziatina, 11, 56125 Pisa PI</p><p>Al termine del Panel ci fermeremo alla Nunziatina (https://lanunziatina.com/) per cenare tutti insieme e festeggiare insieme il compleanno di pisa.dev!</p>",
    "shortDescription": "Un panel con due ospiti d'eccezione per festeggiare insieme il primo compleanno di Pisa.dev<br>Il 20 Luglio non perderti il panel 'From Geek to Great: Supercharging career development with soft skills'.",
    "photoUrl": "https://pisa.dev/_next/image?url=https%3A%2F%2Fdata.pisa.dev%2Fevents%2Fgeek-to-great.jpeg&w=1920&q=75"
  },
  {
    "name": "Google Cloud Platform + Copilot Trustworthiness",
    "data": "19/06/2023",
    "hour": "18:00",
    "location": "Polo Fibonacci, Aula G, Pisa",
    "free": true,
    "registration": true,
    "author": "Emanuele FAbbiani + Alessandro Puccetti",
    "organizer": "Pisa.dev",
    "link": "https://pisa.dev/event/gcp-copilot",
    "description": "<p >In collaborazione con il GDG Pisa, il meet-up di Giugno vi offre due speaker al prezzo di uno! 🚀 Alessandro ed Emanuele ci accompagneranno in un viaggio che vedrà come protagonisti Google Cloud Platoform e l'assistente virtuale più famoso nella community degli sviluppatori: Copilot!</p><p>Dalla collaborazione tra Pisa.dev e GDG Pisa nasce questo meraviglioso evento di Giugno, che metterà in luce due argomenti affascinanti e attuali grazie ai talk dei nostri ospiti.</p><p>Il primo talk sarà incentrato sulla transizione da Cloud Composer a Cloud Workflows. Saranno illustrati i notevoli miglioramenti di velocità, costo ed efficienza che questa migrazione comporta. Grazie a Cloud Workflows, è possibile ottenere un aumento di velocità fino a 10 volte rispetto a Cloud Composer, con una riduzione dei costi fino a 600 volte. Durante il talk, verranno condivisi esempi pratici e best practice per massimizzare i vantaggi offerti da questa transizione.</p><p>Il secondo talk si concentrerà su GitHub Copilot, un assistente virtuale basato sull'intelligenza artificiale che sta rivoluzionando la scrittura del codice. Durante il talk, verranno esaminati i vantaggi di questo strumento, insieme alle preoccupazioni riguardo alla sua adozione diffusa. Saranno discussi studi che sollevano interrogativi sull'effetto sull'apprendimento e sulla sicurezza, offrendo spunti interessanti sulla futura evoluzione degli assistenti virtuali.</p>",
    "shortDescription": "In collaborazione con il GDG Pisa, il meet-up di Giugno vi offre due speaker al prezzo di uno! 🚀 Alessandro ed Emanuele ci accompagneranno in un viaggio che vedrà come protagonisti Google Cloud Platoform e l'assistente virtuale più famoso nella community degli sviluppatori: Copilot!",
    "photoUrl": "https://pisa.dev/_next/image?url=https%3A%2F%2Fdata.pisa.dev%2Fevents%2Fgcp-copilot.jpeg&w=1920&q=75"
  }
]
